; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p16---int100n150-m25---int100c110---s502---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 level139 level140 level141 level142 level143 level144 level145 level146 level147 level148 level149 level150 level151 level152 - fuellevel
)

(:init
(sum level0 level10 level10)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level10 level11)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level10 level12)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level10 level13)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level10 level14)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level10 level15)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level10 level16)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level10 level17)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level10 level18)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level10 level19)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level10 level20)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level10 level21)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level10 level22)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level10 level23)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level10 level24)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level10 level25)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level10 level26)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level10 level27)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level10 level28)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level10 level29)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level10 level30)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level10 level31)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level10 level32)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level10 level33)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level10 level34)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level10 level35)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level10 level36)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level10 level37)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level10 level38)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level10 level39)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level10 level40)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level10 level41)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level10 level42)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level10 level43)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level10 level44)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level10 level45)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level10 level46)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level10 level47)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level10 level48)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level10 level49)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level39 level25 level64)
(sum level40 level10 level50)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level40 level25 level65)
(sum level41 level10 level51)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level41 level25 level66)
(sum level42 level10 level52)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level42 level25 level67)
(sum level43 level10 level53)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level43 level25 level68)
(sum level44 level10 level54)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level44 level25 level69)
(sum level45 level10 level55)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level45 level25 level70)
(sum level46 level10 level56)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level46 level25 level71)
(sum level47 level10 level57)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level47 level25 level72)
(sum level48 level10 level58)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level48 level25 level73)
(sum level49 level10 level59)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level49 level25 level74)
(sum level50 level10 level60)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level50 level25 level75)
(sum level51 level10 level61)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level51 level25 level76)
(sum level52 level10 level62)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level52 level25 level77)
(sum level53 level10 level63)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level53 level25 level78)
(sum level54 level10 level64)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level54 level25 level79)
(sum level55 level10 level65)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level55 level25 level80)
(sum level56 level10 level66)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level56 level25 level81)
(sum level57 level10 level67)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level57 level25 level82)
(sum level58 level10 level68)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level58 level25 level83)
(sum level59 level10 level69)
(sum level59 level20 level79)
(sum level59 level22 level81)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level59 level25 level84)
(sum level60 level10 level70)
(sum level60 level20 level80)
(sum level60 level22 level82)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level60 level25 level85)
(sum level61 level10 level71)
(sum level61 level20 level81)
(sum level61 level22 level83)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level61 level25 level86)
(sum level62 level10 level72)
(sum level62 level20 level82)
(sum level62 level22 level84)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level62 level25 level87)
(sum level63 level10 level73)
(sum level63 level20 level83)
(sum level63 level22 level85)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level63 level25 level88)
(sum level64 level10 level74)
(sum level64 level20 level84)
(sum level64 level22 level86)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level64 level25 level89)
(sum level65 level10 level75)
(sum level65 level20 level85)
(sum level65 level22 level87)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level65 level25 level90)
(sum level66 level10 level76)
(sum level66 level20 level86)
(sum level66 level22 level88)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level66 level25 level91)
(sum level67 level10 level77)
(sum level67 level20 level87)
(sum level67 level22 level89)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level67 level25 level92)
(sum level68 level10 level78)
(sum level68 level20 level88)
(sum level68 level22 level90)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level68 level25 level93)
(sum level69 level10 level79)
(sum level69 level20 level89)
(sum level69 level22 level91)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level69 level25 level94)
(sum level70 level10 level80)
(sum level70 level20 level90)
(sum level70 level22 level92)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level70 level25 level95)
(sum level71 level10 level81)
(sum level71 level20 level91)
(sum level71 level22 level93)
(sum level71 level23 level94)
(sum level71 level24 level95)
(sum level71 level25 level96)
(sum level72 level10 level82)
(sum level72 level20 level92)
(sum level72 level22 level94)
(sum level72 level23 level95)
(sum level72 level24 level96)
(sum level72 level25 level97)
(sum level73 level10 level83)
(sum level73 level20 level93)
(sum level73 level22 level95)
(sum level73 level23 level96)
(sum level73 level24 level97)
(sum level73 level25 level98)
(sum level74 level10 level84)
(sum level74 level20 level94)
(sum level74 level22 level96)
(sum level74 level23 level97)
(sum level74 level24 level98)
(sum level74 level25 level99)
(sum level75 level10 level85)
(sum level75 level20 level95)
(sum level75 level22 level97)
(sum level75 level23 level98)
(sum level75 level24 level99)
(sum level75 level25 level100)
(sum level76 level10 level86)
(sum level76 level20 level96)
(sum level76 level22 level98)
(sum level76 level23 level99)
(sum level76 level24 level100)
(sum level76 level25 level101)
(sum level77 level10 level87)
(sum level77 level20 level97)
(sum level77 level22 level99)
(sum level77 level23 level100)
(sum level77 level24 level101)
(sum level77 level25 level102)
(sum level78 level10 level88)
(sum level78 level20 level98)
(sum level78 level22 level100)
(sum level78 level23 level101)
(sum level78 level24 level102)
(sum level78 level25 level103)
(sum level79 level10 level89)
(sum level79 level20 level99)
(sum level79 level22 level101)
(sum level79 level23 level102)
(sum level79 level24 level103)
(sum level79 level25 level104)
(sum level80 level10 level90)
(sum level80 level20 level100)
(sum level80 level22 level102)
(sum level80 level23 level103)
(sum level80 level24 level104)
(sum level80 level25 level105)
(sum level81 level10 level91)
(sum level81 level20 level101)
(sum level81 level22 level103)
(sum level81 level23 level104)
(sum level81 level24 level105)
(sum level81 level25 level106)
(sum level82 level10 level92)
(sum level82 level20 level102)
(sum level82 level22 level104)
(sum level82 level23 level105)
(sum level82 level24 level106)
(sum level82 level25 level107)
(sum level83 level10 level93)
(sum level83 level20 level103)
(sum level83 level22 level105)
(sum level83 level23 level106)
(sum level83 level24 level107)
(sum level83 level25 level108)
(sum level84 level10 level94)
(sum level84 level20 level104)
(sum level84 level22 level106)
(sum level84 level23 level107)
(sum level84 level24 level108)
(sum level84 level25 level109)
(sum level85 level10 level95)
(sum level85 level20 level105)
(sum level85 level22 level107)
(sum level85 level23 level108)
(sum level85 level24 level109)
(sum level85 level25 level110)
(sum level86 level10 level96)
(sum level86 level20 level106)
(sum level86 level22 level108)
(sum level86 level23 level109)
(sum level86 level24 level110)
(sum level86 level25 level111)
(sum level87 level10 level97)
(sum level87 level20 level107)
(sum level87 level22 level109)
(sum level87 level23 level110)
(sum level87 level24 level111)
(sum level87 level25 level112)
(sum level88 level10 level98)
(sum level88 level20 level108)
(sum level88 level22 level110)
(sum level88 level23 level111)
(sum level88 level24 level112)
(sum level88 level25 level113)
(sum level89 level10 level99)
(sum level89 level20 level109)
(sum level89 level22 level111)
(sum level89 level23 level112)
(sum level89 level24 level113)
(sum level89 level25 level114)
(sum level90 level10 level100)
(sum level90 level20 level110)
(sum level90 level22 level112)
(sum level90 level23 level113)
(sum level90 level24 level114)
(sum level90 level25 level115)
(sum level91 level10 level101)
(sum level91 level20 level111)
(sum level91 level22 level113)
(sum level91 level23 level114)
(sum level91 level24 level115)
(sum level91 level25 level116)
(sum level92 level10 level102)
(sum level92 level20 level112)
(sum level92 level22 level114)
(sum level92 level23 level115)
(sum level92 level24 level116)
(sum level92 level25 level117)
(sum level93 level10 level103)
(sum level93 level20 level113)
(sum level93 level22 level115)
(sum level93 level23 level116)
(sum level93 level24 level117)
(sum level93 level25 level118)
(sum level94 level10 level104)
(sum level94 level20 level114)
(sum level94 level22 level116)
(sum level94 level23 level117)
(sum level94 level24 level118)
(sum level94 level25 level119)
(sum level95 level10 level105)
(sum level95 level20 level115)
(sum level95 level22 level117)
(sum level95 level23 level118)
(sum level95 level24 level119)
(sum level95 level25 level120)
(sum level96 level10 level106)
(sum level96 level20 level116)
(sum level96 level22 level118)
(sum level96 level23 level119)
(sum level96 level24 level120)
(sum level96 level25 level121)
(sum level97 level10 level107)
(sum level97 level20 level117)
(sum level97 level22 level119)
(sum level97 level23 level120)
(sum level97 level24 level121)
(sum level97 level25 level122)
(sum level98 level10 level108)
(sum level98 level20 level118)
(sum level98 level22 level120)
(sum level98 level23 level121)
(sum level98 level24 level122)
(sum level98 level25 level123)
(sum level99 level10 level109)
(sum level99 level20 level119)
(sum level99 level22 level121)
(sum level99 level23 level122)
(sum level99 level24 level123)
(sum level99 level25 level124)
(sum level100 level10 level110)
(sum level100 level20 level120)
(sum level100 level22 level122)
(sum level100 level23 level123)
(sum level100 level24 level124)
(sum level100 level25 level125)
(sum level101 level10 level111)
(sum level101 level20 level121)
(sum level101 level22 level123)
(sum level101 level23 level124)
(sum level101 level24 level125)
(sum level101 level25 level126)
(sum level102 level10 level112)
(sum level102 level20 level122)
(sum level102 level22 level124)
(sum level102 level23 level125)
(sum level102 level24 level126)
(sum level102 level25 level127)
(sum level103 level10 level113)
(sum level103 level20 level123)
(sum level103 level22 level125)
(sum level103 level23 level126)
(sum level103 level24 level127)
(sum level103 level25 level128)
(sum level104 level10 level114)
(sum level104 level20 level124)
(sum level104 level22 level126)
(sum level104 level23 level127)
(sum level104 level24 level128)
(sum level104 level25 level129)
(sum level105 level10 level115)
(sum level105 level20 level125)
(sum level105 level22 level127)
(sum level105 level23 level128)
(sum level105 level24 level129)
(sum level105 level25 level130)
(sum level106 level10 level116)
(sum level106 level20 level126)
(sum level106 level22 level128)
(sum level106 level23 level129)
(sum level106 level24 level130)
(sum level106 level25 level131)
(sum level107 level10 level117)
(sum level107 level20 level127)
(sum level107 level22 level129)
(sum level107 level23 level130)
(sum level107 level24 level131)
(sum level107 level25 level132)
(sum level108 level10 level118)
(sum level108 level20 level128)
(sum level108 level22 level130)
(sum level108 level23 level131)
(sum level108 level24 level132)
(sum level108 level25 level133)
(sum level109 level10 level119)
(sum level109 level20 level129)
(sum level109 level22 level131)
(sum level109 level23 level132)
(sum level109 level24 level133)
(sum level109 level25 level134)
(sum level110 level10 level120)
(sum level110 level20 level130)
(sum level110 level22 level132)
(sum level110 level23 level133)
(sum level110 level24 level134)
(sum level110 level25 level135)
(sum level111 level10 level121)
(sum level111 level20 level131)
(sum level111 level22 level133)
(sum level111 level23 level134)
(sum level111 level24 level135)
(sum level111 level25 level136)
(sum level112 level10 level122)
(sum level112 level20 level132)
(sum level112 level22 level134)
(sum level112 level23 level135)
(sum level112 level24 level136)
(sum level112 level25 level137)
(sum level113 level10 level123)
(sum level113 level20 level133)
(sum level113 level22 level135)
(sum level113 level23 level136)
(sum level113 level24 level137)
(sum level113 level25 level138)
(sum level114 level10 level124)
(sum level114 level20 level134)
(sum level114 level22 level136)
(sum level114 level23 level137)
(sum level114 level24 level138)
(sum level114 level25 level139)
(sum level115 level10 level125)
(sum level115 level20 level135)
(sum level115 level22 level137)
(sum level115 level23 level138)
(sum level115 level24 level139)
(sum level115 level25 level140)
(sum level116 level10 level126)
(sum level116 level20 level136)
(sum level116 level22 level138)
(sum level116 level23 level139)
(sum level116 level24 level140)
(sum level116 level25 level141)
(sum level117 level10 level127)
(sum level117 level20 level137)
(sum level117 level22 level139)
(sum level117 level23 level140)
(sum level117 level24 level141)
(sum level117 level25 level142)
(sum level118 level10 level128)
(sum level118 level20 level138)
(sum level118 level22 level140)
(sum level118 level23 level141)
(sum level118 level24 level142)
(sum level118 level25 level143)
(sum level119 level10 level129)
(sum level119 level20 level139)
(sum level119 level22 level141)
(sum level119 level23 level142)
(sum level119 level24 level143)
(sum level119 level25 level144)
(sum level120 level10 level130)
(sum level120 level20 level140)
(sum level120 level22 level142)
(sum level120 level23 level143)
(sum level120 level24 level144)
(sum level120 level25 level145)
(sum level121 level10 level131)
(sum level121 level20 level141)
(sum level121 level22 level143)
(sum level121 level23 level144)
(sum level121 level24 level145)
(sum level121 level25 level146)
(sum level122 level10 level132)
(sum level122 level20 level142)
(sum level122 level22 level144)
(sum level122 level23 level145)
(sum level122 level24 level146)
(sum level122 level25 level147)
(sum level123 level10 level133)
(sum level123 level20 level143)
(sum level123 level22 level145)
(sum level123 level23 level146)
(sum level123 level24 level147)
(sum level123 level25 level148)
(sum level124 level10 level134)
(sum level124 level20 level144)
(sum level124 level22 level146)
(sum level124 level23 level147)
(sum level124 level24 level148)
(sum level124 level25 level149)
(sum level125 level10 level135)
(sum level125 level20 level145)
(sum level125 level22 level147)
(sum level125 level23 level148)
(sum level125 level24 level149)
(sum level125 level25 level150)
(sum level126 level10 level136)
(sum level126 level20 level146)
(sum level126 level22 level148)
(sum level126 level23 level149)
(sum level126 level24 level150)
(sum level126 level25 level151)
(sum level127 level10 level137)
(sum level127 level20 level147)
(sum level127 level22 level149)
(sum level127 level23 level150)
(sum level127 level24 level151)
(sum level127 level25 level152)
(sum level128 level10 level138)
(sum level128 level20 level148)
(sum level128 level22 level150)
(sum level128 level23 level151)
(sum level128 level24 level152)
(sum level129 level10 level139)
(sum level129 level20 level149)
(sum level129 level22 level151)
(sum level129 level23 level152)
(sum level130 level10 level140)
(sum level130 level20 level150)
(sum level130 level22 level152)
(sum level131 level10 level141)
(sum level131 level20 level151)
(sum level132 level10 level142)
(sum level132 level20 level152)
(sum level133 level10 level143)
(sum level134 level10 level144)
(sum level135 level10 level145)
(sum level136 level10 level146)
(sum level137 level10 level147)
(sum level138 level10 level148)
(sum level139 level10 level149)
(sum level140 level10 level150)
(sum level141 level10 level151)
(sum level142 level10 level152)

(connected l0 l3)
(fuelcost level20 l0 l3)
(connected l0 l4)
(fuelcost level23 l0 l4)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l1 l3)
(fuelcost level24 l1 l3)
(connected l1 l4)
(fuelcost level10 l1 l4)
(connected l2 l1)
(fuelcost level25 l2 l1)
(connected l2 l4)
(fuelcost level22 l2 l4)
(connected l3 l0)
(fuelcost level20 l3 l0)
(connected l3 l1)
(fuelcost level24 l3 l1)
(connected l3 l4)
(fuelcost level22 l3 l4)
(connected l4 l0)
(fuelcost level23 l4 l0)
(connected l4 l1)
(fuelcost level10 l4 l1)
(connected l4 l2)
(fuelcost level22 l4 l2)
(connected l4 l3)
(fuelcost level22 l4 l3)

(at t0 l1)
(fuel t0 level152)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l0)
(at p3 l1)
(at p4 l0)
(at p5 l1)
(at p6 l3)
(at p7 l1)
(at p8 l0)
(at p9 l2)
(at p10 l1)
(at p11 l0)
(at p12 l0)
(at p13 l2)
(at p14 l4)
(at p15 l0)
)

(:goal
(and
(at p0 l4)
(at p1 l4)
(at p2 l3)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l2)
(at p7 l4)
(at p8 l2)
(at p9 l3)
(at p10 l0)
(at p11 l3)
(at p12 l1)
(at p13 l3)
(at p14 l1)
(at p15 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 16
2. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 16
3. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 16
4. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 16
5. (drive t0 l1 l2 level127 level25 level152)
   deleted: (at t0 l1) (fuel t0 level152)
   added: (at t0 l2) (fuel t0 level127)
   goals met: 0 of 16
6. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 16
7. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 0 of 16
8. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 16
9. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 16
10. (drive t0 l2 l4 level105 level22 level127)
   deleted: (at t0 l2) (fuel t0 level127)
   added: (at t0 l4) (fuel t0 level105)
   goals met: 0 of 16
11. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 1 of 16
12. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 2 of 16
13. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 3 of 16
14. (load p14 t0 l4)
   deleted: (at p14 l4)
   added: (in p14 t0)
   goals met: 3 of 16
15. (drive t0 l4 l0 level82 level23 level105)
   deleted: (at t0 l4) (fuel t0 level105)
   added: (at t0 l0) (fuel t0 level82)
   goals met: 3 of 16
16. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 3 of 16
17. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 3 of 16
18. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 3 of 16
19. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 3 of 16
20. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 3 of 16
21. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 3 of 16
22. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 4 of 16
23. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 5 of 16
24. (drive t0 l0 l3 level62 level20 level82)
   deleted: (at t0 l0) (fuel t0 level82)
   added: (at t0 l3) (fuel t0 level62)
   goals met: 5 of 16
25. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 5 of 16
26. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 6 of 16
27. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 7 of 16
28. (unload p15 t0 l3)
   deleted: (in p15 t0)
   added: (at p15 l3)
   goals met: 8 of 16
29. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 9 of 16
30. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 10 of 16
31. (drive t0 l3 l1 level38 level24 level62)
   deleted: (at t0 l3) (fuel t0 level62)
   added: (at t0 l1) (fuel t0 level38)
   goals met: 10 of 16
32. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 11 of 16
33. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 12 of 16
34. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 13 of 16
35. (drive t0 l1 l2 level13 level25 level38)
   deleted: (at t0 l1) (fuel t0 level38)
   added: (at t0 l2) (fuel t0 level13)
   goals met: 13 of 16
36. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 14 of 16
37. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 15 of 16
38. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 16 of 16
